xml/BaseSoapSolR.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:des="http://DescargaMasivaTerceros.sat.gob.mx"><soapenv:Header></soapenv:Header><soapenv:Body><des:SolicitaDescargaRecibidos><des:solicitud EstadoComprobante="Vigente" FechaInicial="--FECHAINI--" FechaFinal="--FECHAFIN--" TipoSolicitud="CFDI" RfcReceptor="--RFC--"><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo xmlns="http://www.w3.org/2000/09/xmldsig#"><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></CanonicalizationMethod><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"></SignatureMethod><Reference URI="#_0"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"></Transform></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"></DigestMethod><DigestValue>--DIGEST--</DigestValue></Reference></SignedInfo><SignatureValue>--SIGNATURE--</SignatureValue><KeyInfo><X509Data><X509IssuerSerial><X509IssuerName></X509IssuerName><X509SerialNumber>--SERIAL--</X509SerialNumber></X509IssuerSerial><X509Certificate>--CERT--</X509Certificate></X509Data></KeyInfo></Signature></des:solicitud></des:SolicitaDescargaRecibidos></soapenv:Body></soapenv:Envelope>